### Pandas Utility Functions

##### Similar to numpy, pandas also has a few utility function to identify and detect null values

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

##### The opposite ones also exist

In [6]:
pd.notnull(None)

False

In [7]:
pd.notnull(np.nan)

False

In [8]:
pd.notnull(3)

True

##### These functions also work with Series and DataFrame

In [9]:
pd.isnull(pd.Series([1, np.nan,7]))

0    False
1     True
2    False
dtype: bool

In [10]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [11]:
pd.isnull(pd.DataFrame({
    'column A': [1, np.nan, 7],
    'column B': [np.nan, 2, 3],
    'column C': [np.nan, 2, np.nan]}))

   column A  column B  column C
0     False      True      True
1      True     False     False
2     False     False      True

## Pandas Operations with Missing Values

##### Pandas manages missing values more gracefully than numpy . 'NaN' will no longer behave as 'viruses' and operations
##### will hust ignore them completely

In [12]:
pd.Series([1,2,np.nan]).count()

2

In [13]:
pd.Series([1,2,np.nan]).sum()

3.0

In [14]:
pd.Series ([2, 2, np.nan]).mean()

2.0

## Filtering missing Data

##### As we saw with numpy, we could combine boolean selection + 'pd.isnull' to filter out those 'nan' s and null values

In [15]:
s=pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [16]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [17]:
pd.notnull(s).sum()

4

In [18]:
pd.isnull(s).sum()

2

In [19]:
pd.notnull(s).count()

6

In [20]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

##### But both 'notnull' and 'isnull' are also methods of 'Series' and 'DataFrame' s, so we could use it that way:

In [21]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [22]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [23]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

## Dropping null values

##### Boolean selection + 'notnull()' seeems a little bit verbose and repetitive. And as we said before, any repetitive task will probably have a better more DRY way, In this case, we can use the 'droona' method.

In [24]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [25]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

## Dropping null values on DataFrames

##### You saw how easy it is to drop 'na' s with a Series. But with DataFrames, there will be a few more things to consider because you can't drop single values. You can only drop entire colums or rows. Let's start with a simple DataFrame:

In [26]:
df = pd.DataFrame({
    'Column A':[1, np.nan, 30, np.nan],
    'Column B':[2, 8, 31, np.nan],
    'Column C':[np.nan, 9, 32, 100],
    'Column D':[5, 8, 34, 110],})

In [27]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [29]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [30]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [31]:
df.shape

(4, 4)

##### The default 'dropna' behaviour will drop all the rows in which any null value is present:

In [32]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

##### In this case, we're dropping 'rows'. Rows containing null values are dropped from the DF. You can also use the 'axis' parameter to drop columns containing null values

In [33]:
df.dropna(axis=1)   # axis = 1 refers to 'columns' also works

   Column D
0         5
1         8
2        34
3       110

##### In this case, any row or column that contains at least one nyll value will ne dropped. Which can be, depending on the case, too extreme. You can control this behaviour with the 'how' parameter. Can be either 'any' or 'all'

In [34]:
df2 = pd.DataFrame({
    'Column A':[1, np.nan, 30],
    'Column B':[2, 8, 31],
    'Column C':[np.nan, np.nan, 100]})

In [35]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [36]:
df.dropna(how='all')   # drop the 'column' that have all the value null

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [37]:
df.dropna(how='any')   # default behaviour. Drop the rows that have any 'nan'

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

##### You can also use the 'thresh' parameter to indicate a threshold (a minimum number) of non-null values for the row/column to be kept:

In [38]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [39]:
df.dropna(thresh=3)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [40]:
df.dropna(thresh=3, axis = 'columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

## Filling null values

##### Sometimes instead of dropping 'null' values, we might need to replace them with some value. This highly depends on your context and the dataset you're currently working on. Sometimes a 'nan' can be replaced with a '0'; sometimes it can be replaced with 'mean' of the sample, and some other times, you can take the 'closet' value. Again, it depends on the context. We'll show you the different methods and mechanisms and you can then apply them to your own problem.

In [41]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

##### Filling nulls with arbitary value

In [42]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [43]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [44]:
s     # original Series is still the same. it doesn't alter it

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

##### Filling nulls with contigous (close) values

##### The 'method' arguments is used to fill null values with other values close to that null one:

In [45]:
s.fillna(method='ffill')    #forward fill

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [46]:
s.fillna(method='bfill')    # backward fill

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

##### This can still leave null values at the extremes of the Series/DataFrame:

In [47]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [48]:
pd.Series([1, np.nan, 3, np.nan, 9]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    9.0
4    9.0
dtype: float64

## Filling null values on DataFrames

##### The f\'fillna' method also works on 'DataFrame's and it works similarly. The main differences areas that you can specify the'axis' (as usual rows or columns) to use to fill the values (especially for methods) and that you have more control on the values passed

In [49]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [50]:
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [51]:
df.fillna(method = 'ffill', axis = 0)   # column

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [52]:
df.fillna(method = 'ffill', axis = 1)     # rows

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

In [53]:
df.fillna(method = 'bfill', axis = 0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       9.0         5
1      30.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [54]:
df.fillna(method = 'bfill', axis = 1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       5.0       5.0
1       8.0       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3     100.0     100.0     100.0     110.0

## Checking if there are 'NA's

##### The question is, Does this 'Series' or 'DataFrame' contain any missing values? The answer should be yes or no: 'True' or 'False'. How can you verify it?

##### Example 1: Checking the length

##### If there are missing values, 's.dropna()' will have less elements than 's':

In [55]:
s.dropna().count()

4

In [56]:
missing_values = len(s.dropna()) != len(s)
missing_values

True

##### There's also a 'count' method that excludes 'nan's from its result:

In [57]:
len(s)

6

In [58]:
s.count()

4

##### So we could just do:

In [59]:
missing_values = s.count() != len(s)
missing_values

True

##### More Pythonic solution 'any'

##### The methods 'any' and 'all' check if either there's 'any' True value in a Series or 'all' the values are 'True'. They work inthe same way as in Python:

In [60]:
pd.Series([True, False, False]).any()

True

In [61]:
pd.Series([True, False, False]).all()

False

In [62]:
pd.Series([True, True, True]).all()

True

##### The 'isnull()' method returned a Boolean Series with 'True'values wherever there was a 'nan':

In [63]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [64]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

##### So we can just use the 'any' method with the boolean array returned:

In [65]:
pd.Series([1, np.nan]).isnull().any()

True

In [66]:
pd.Series([1, 2]).isnull().any()

False

In [67]:
s.isnull().any()

True

##### A more strict version would check only the 'values' of the Series:

In [68]:
s.isnull().values

array([False, False, False,  True,  True, False])

In [69]:
s.isnull().values.any()

True

## Cleaning Not-Null Values

##### After dealing with many datasets Ican tell you that 'missing data' is not such a big deal. The best thing that can happen is to clearly see values like 'np.nan'. The only thing you need to do is just use method like 'isnull' abd 'fillna'/'dropna' and pandas will take care of the rest.

##### But sometimes, you can have invalid values that are not just 'missing data' ('None' or nan') for example

In [70]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

##### The previous 'DataFrame' doesn't have any 'missing value', but clearly has invalid data. '290 doesn't seem like a calid age and 'D' and '?' do not correspond with any known sex category. How can you clean these not-missing but clearly invalid values then?

## Finding Unique Values

##### The first step to clean invalid values is to notice them, then identify them and finally handle them appropriately (remove them, replace them, etc). Usually, for a 'categorical' type of field (like Sex, which only takes values of a discrete set ('M', 'F'), we start by analyzing the variety of values present for that, we use the 'unique()' method:

In [71]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [72]:
df['Sex'].value_counts()

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

##### Clearly, if you see values like 'D' or '?', it'll immediatel raise your attention. Now, what to do with them? Let's say you picked up the phone, called the survey company and they told you that 'D' was a typo and it should actually be 'F'. You can use the 'replace' function to replace these values:

In [73]:
df['Sex'].replace('D', 'F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

##### It can accept a dictionary of values to replace. For example, they also told you that there might be a few 'N's, that should actually be 'M's:

In [74]:
df['Sex'].replace({'D': 'F', 'N' : 'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

##### If you have columns to replace, you could apply it at 'DataFrame level':

In [75]:
df.replace({'Sex': {'D' : 'F','N' :'M'},
            'Age' : {290: 29}})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

##### In the previous example, I explicitly replaced 290 with 29 (assuming it was just an extra 0 entered at data-entry phase). But what if you'd like to remove all the extra 0s from the ages columns? (example '150 > 15', '490 > 49').

##### The first step would be to just set the limit of the 'not possible' age. Is it 100?, 200? Let's say that anything above 100 isn't credible for our dataset. we can then combine boolean selection with the operation:

In [76]:
df[df['Age'] > 100]

  Sex  Age
3   D  290

##### And we can now just divide by 10

In [77]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [78]:
df

  Sex   Age
0   M  29.0
1   F  30.0
2   F  24.0
3   D  29.0
4   ?  25.0

## Duplicates

##### Checking duplicates values is extremelu simple. it'll behave differently between Series and DataFrames. Let's start with Series. As an example, let's say we're throwing a fancy party and we're inviting Ambassadors from Europe. But can only invite onw Ambassador per country. This is our original list and as you can see, both the UK and Germany have duplicate ambassadors

In [79]:
ambassadors = pd. Series (['France', 'United Kingdom', 'United Kingdom', 'Italy', 'Germany', 'Germany', 'Germany',],
                          index = ['Gerard Araud', 'Kim Darroch', 'Peter Westmacott', 'Armando Varricchio', 'Peter Wittig', 'Peter Ammon', 'Kalus Scharioth'])

In [80]:
ambassadors

Gerard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Kalus Scharioth              Germany
dtype: object

##### The two most imprtant methods to deal with duplicates are 'duplicated' (that will tell you which values are duplicated) and 'drop_duplicates' (which will just get rid of duplicates):

In [81]:
ambassadors.duplicated()    # returns True from the second occurance

Gerard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Kalus Scharioth        True
dtype: bool

##### In this case 'duplicated' didn't consider 'Kim Darroch', the first instance of the United Kingdom or 'Peter Wittig' as duplicates. That's because, by default, it'll consider the first occurrence of the value as not duplicate. You can change this behaviour with the 'keep parameter'

In [82]:
ambassadors.duplicated(keep='last')

Gerard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Kalus Scharioth       False
dtype: bool

##### In this case, the result is 'flipped', 'Kim Darroch' and 'Peter Wittig' (the first ambassadors of theri countries) are not considered duplicates, but 'Peter Westmacott' and Klaus Scharioth' are not duplicates. You can also choose to mark all of them as duplicates with the 'keep parameter'

In [83]:
ambassadors.duplicated(keep =False)

Gerard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Kalus Scharioth        True
dtype: bool

##### A similar method is 'drop_duplicates, which just executes the duplicated values and also accepts the 'keep' parameter:

In [84]:
ambassadors.drop_duplicates()

Gerard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [85]:
ambassadors.drop_duplicates(keep='last')

Gerard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Kalus Scharioth              Germany
dtype: object

In [86]:
ambassadors.drop_duplicates(keep=False)

Gerard Araud          France
Armando Varricchio     Italy
dtype: object

## Duplicates in DataFrame

##### Conceptually speaking, duplicates in DataFrame happen at 'row' level. Two rows with exactly the same values are considered to be duplicates:

In [87]:
players=pd.DataFrame({'Name': ['Kobe Bryant', 'LeBron James','Kobe Bryant', 'Carmelo Anthony', 'Kobe Bryant'],
                      'Pos': ['SG', 'SF', 'SG', 'SF', 'SF',]})

In [88]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

##### In the previous DataFrame, we clearly see that Kobe is duplicated, but he appears with two different positions. What does 'duplicated' say?

In [89]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

##### Again, conceptually, 'duplicated' means 'all the column values should be duplicated'. We can customise this with the 'subset' parameter:

In [90]:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

##### And the same rules of 'keep' still apply"

In [91]:
players.duplicated(subset=['Name'], keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

##### 'drop_duplicates' takes the same parameter

In [92]:
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [93]:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [94]:
players.duplicated(subset=['Name'], keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

## Text Handling

##### Clearing text values can be incredinly hard. Invalid text values involves 99% of the time, mistyping, which is comletely unpredictable and doesn't follow any pattern. Thankfully, it's not so common these days, where data-entry tasks have been replaced by machines. Still let's explore the most common cases:

## Splitting Columns

##### The result of a survey is loaded and this is what you get:

In [95]:
df=pd.DataFrame({'Data': ['1987_M_US_1', '1998_M_UK_1', '1992_F_US_2', '1970_M_  IT_1', '1985_F_I  T_2']})

In [96]:
df

            Data
0    1987_M_US_1
1    1998_M_UK_1
2    1992_F_US_2
3  1970_M_  IT_1
4  1985_F_I  T_2

In [97]:
df.info

<bound method DataFrame.info of             Data
0    1987_M_US_1
1    1998_M_UK_1
2    1992_F_US_2
3  1970_M_  IT_1
4  1985_F_I  T_2>

##### You know that the single columns represented the values 'year, Sex, Country and number of children', but it's all been grouped in the same column and separated by an underscore. Pandas has a convenient method named 'split' that can be used in these situations:

In [98]:
df['Data'].str.split('_')

0      [1987, M, US, 1]
1      [1998, M, UK, 1]
2      [1992, F, US, 2]
3    [1970, M,   IT, 1]
4    [1985, F, I  T, 2]
Name: Data, dtype: object

In [99]:
df['Data'].str.split('_', expand = True)

      0  1     2  3
0  1987  M    US  1
1  1998  M    UK  1
2  1992  F    US  2
3  1970  M    IT  1
4  1985  F  I  T  2

In [100]:
df = df['Data'].str.split('_', expand = True)

In [101]:
df.columns = ['Year', 'Sex', 'Country', 'No Children']

##### You can also check which columns contains a given value with the 'contains' method.

In [102]:
df

   Year Sex Country No Children
0  1987   M      US           1
1  1998   M      UK           1
2  1992   F      US           2
3  1970   M      IT           1
4  1985   F    I  T           2

In [103]:
df['Year'].str.contains('\?')

0    False
1    False
2    False
3    False
4    False
Name: Year, dtype: bool

##### Contains takes a regex/pattern as first values, so we need to escape the '?' symbol as it has a specual meaning for these patterns. Regular letters don't need escaping

In [104]:
df['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

##### Removing blank spaces like in 'US' or 'I   T' can be achieved with 'strip' ('lstirp' and 'rstrip' also exist) or just 'replace'

In [105]:
df['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [106]:
df['Country'].str.replace('','')

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

##### As we said, 'replace' and 'contains' take regex patterns, which can make it easier to replace values in bulk:

In [107]:
df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

C:\Users\ifybe\AppData\Local\Temp/ipykernel_140/2331653364.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

0    1987
1    1998
2    1992
3    1970
4    1985
Name: Year, dtype: object

##### But be warned:

#####     Some people, when confronted with a problem, think 'I know, i'll use regular expressions'. Now they have two        problems.

##### As you can see, all these sting/text-related operatons are applied over the 'str' attribute of the series. That's because they have a special place in Series handling and you can read more about it

## Data Cleaning in Python Practical Examples

### Loading or RReading the File

##### *Encoding Error
##### *Inconsistent rows

In [108]:
df = pd.read_csv("C:\\Users\\ifybe\\OneDrive\\Desktop\\Data Science\\Class Downloads for Data Science\\Unclean+data+set.csv")

###### UTC Encoding

In [109]:
df1 = pd.read_csv(("C:\\Users\\ifybe\\OneDrive\\Desktop\\Data Science\\Class Downloads for Data Science\\Unclean+data+set.csv"), encoding = 'latin1')

In [110]:
df1.head()

,movie_title,num_critic_for_reviews,duration,DIRECTOR_facebook_likes,actor_3_facebook_likes,ACTOR_1_facebook_likes,gross,num_voted_users,Cast_Total_facebook_likes,facenumber_in_poster,num_user_for_reviews,budget,title_year,ACTOR_2_facebook_likes,imdb_score,title_year.1
0,Avatar?ï¿½,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?ï¿½,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?ï¿½,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?ï¿½,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?ï¿½,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN

In [111]:
# Use Text Editor and Save it as Utf-8, ISO-8859-1, Latin1

## How to Change the Case to Upper

In [112]:
df.columns

Index(['movie_title', 'num_critic_for_reviews', 'duration',
       'DIRECTOR_facebook_likes', 'actor_3_facebook_likes',
       'ACTOR_1_facebook_likes', 'gross', 'num_voted_users',
       'Cast_Total_facebook_likes', 'facenumber_in_poster',
       'num_user_for_reviews', 'budget', 'title_year',
       'ACTOR_2_facebook_likes', 'imdb_score', 'title_year.1'],
      dtype='object')

In [113]:
df.columns.str.upper()

Index(['MOVIE_TITLE', 'NUM_CRITIC_FOR_REVIEWS', 'DURATION',
       'DIRECTOR_FACEBOOK_LIKES', 'ACTOR_3_FACEBOOK_LIKES',
       'ACTOR_1_FACEBOOK_LIKES', 'GROSS', 'NUM_VOTED_USERS',
       'CAST_TOTAL_FACEBOOK_LIKES', 'FACENUMBER_IN_POSTER',
       'NUM_USER_FOR_REVIEWS', 'BUDGET', 'TITLE_YEAR',
       'ACTOR_2_FACEBOOK_LIKES', 'IMDB_SCORE', 'TITLE_YEAR.1'],
      dtype='object')

In [114]:
df.columns.str.lower()

Index(['movie_title', 'num_critic_for_reviews', 'duration',
       'director_facebook_likes', 'actor_3_facebook_likes',
       'actor_1_facebook_likes', 'gross', 'num_voted_users',
       'cast_total_facebook_likes', 'facenumber_in_poster',
       'num_user_for_reviews', 'budget', 'title_year',
       'actor_2_facebook_likes', 'imdb_score', 'title_year.1'],
      dtype='object')

In [115]:
df.columns= df.columns.str.upper()

In [116]:
df.columns

Index(['MOVIE_TITLE', 'NUM_CRITIC_FOR_REVIEWS', 'DURATION',
       'DIRECTOR_FACEBOOK_LIKES', 'ACTOR_3_FACEBOOK_LIKES',
       'ACTOR_1_FACEBOOK_LIKES', 'GROSS', 'NUM_VOTED_USERS',
       'CAST_TOTAL_FACEBOOK_LIKES', 'FACENUMBER_IN_POSTER',
       'NUM_USER_FOR_REVIEWS', 'BUDGET', 'TITLE_YEAR',
       'ACTOR_2_FACEBOOK_LIKES', 'IMDB_SCORE', 'TITLE_YEAR.1'],
      dtype='object')

## Renaming Columns

In [117]:
df.rename(columns = {'DURATION' : 'TIME'})

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,TIME,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?�,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?�,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?�,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?�,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?�,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN
5,Spider-Man 3?�,392,156.0,23,4000,24000,336530303,383056.0,46055.0,NaN,1902,258000000,2007,11000.0,6.2,2007.0
6,Tangled?�,324,NaN,15,284,799,200807262,294810.0,NaN,1.0,387,260000000,2010,553.0,7.8,NaN
7,Avengers: Age of Ultron?�,635,141.0,10,19000,26000,458991599,462669.0,92000.0,4.0,1117,250000000,2015,21000.0,7.5,NaN
8,Avengers: Age of Ultron?�,635,141.0,10,19000,26000,458991599,462669.0,92000.0,4.0,1117,250000000,2015,21000.0,7.5,2015.0
9,Harry Potter and the Half-Blood Prince?�,375,153.0,282,10000,25000,301956980,321795.0,58753.0,3.0,973,250000000,2009,11000.0,7.5,NaN
10,Batman v Superman: Dawn of Justice?�,673,183.0,NaN,2000,15000,330249062,NaN,24450.0,NaN,3018,250000000,2016,NaN,6.9,2016.0
11,Superman Returns?�,434,169.0,NaN,903,18000,200069408,240396.0,NaN,2.0,2367,209000000,2006,10000.0,6.1,NaN
12,Quantum of Solace?�,403,106.0,395,393,451,168368427,330784.0,2023.0,1.0,1243,200000000,2008,412.0,6.7,2008.0
13,Pirates of the Caribbean: Dead Man's Chest?�,313,151.0,563,1000,40000,423032628,522040.0,48486.0,2.0,1832,225000000,2006,5000.0,7.3,2008.0

## Missing Data

###### *Add a default value for missing data or use mean to fill it
###### *Delete the row/column with missing data
###### *Interpolate the rows
###### *Replace

### To Check for Missing Data

##### False means no missing data

###### *df.isnull().sum()int
###### *df.isnull().any() boolean

In [118]:
df.isnull()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,False,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False
1,False,False,True,False,False,False,False,False,False,True,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,True,False,False,False,False,False,False,True,False,False,False,False,False,True
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
5,False,False,False,False,False,False,False,False,False,True,False,False,False,False,False,False
6,False,False,True,False,False,False,False,False,True,False,False,False,False,False,False,True
7,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
8,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
10,False,False,False,True,False,False,False,True,False,True,False,False,False,True,False,False
11,False,False,False,True,False,False,False,False,True,False,False,False,False,False,False,True
12,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
13,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [119]:
df.isnull().any()

MOVIE_TITLE                  False
NUM_CRITIC_FOR_REVIEWS       False
DURATION                      True
DIRECTOR_FACEBOOK_LIKES       True
ACTOR_3_FACEBOOK_LIKES       False
ACTOR_1_FACEBOOK_LIKES       False
GROSS                        False
NUM_VOTED_USERS               True
CAST_TOTAL_FACEBOOK_LIKES     True
FACENUMBER_IN_POSTER          True
NUM_USER_FOR_REVIEWS         False
BUDGET                       False
TITLE_YEAR                   False
ACTOR_2_FACEBOOK_LIKES        True
IMDB_SCORE                   False
TITLE_YEAR.1                  True
dtype: bool

In [120]:
# Columns with NAN using True/False
# False means it doesn't have a NAN
# For entire DataFrame
df.isnull().any().any()

True

In [121]:
# Columns with NAN using Integer
df.isnull().sum()

MOVIE_TITLE                  0
NUM_CRITIC_FOR_REVIEWS       0
DURATION                     3
DIRECTOR_FACEBOOK_LIKES      2
ACTOR_3_FACEBOOK_LIKES       0
ACTOR_1_FACEBOOK_LIKES       0
GROSS                        0
NUM_VOTED_USERS              1
CAST_TOTAL_FACEBOOK_LIKES    2
FACENUMBER_IN_POSTER         5
NUM_USER_FOR_REVIEWS         0
BUDGET                       0
TITLE_YEAR                   0
ACTOR_2_FACEBOOK_LIKES       1
IMDB_SCORE                   0
TITLE_YEAR.1                 7
dtype: int64

In [122]:
# Total Number of Missing Values
df.isnull().sum().sum()

21

## Adding A Default Value or Filling the Missing Data

In [123]:
df.head()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?�,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?�,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?�,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?�,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?�,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN

In [124]:
df_with_0 = df.fillna(0)

In [125]:
df_with_0.head()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?�,723,178.0,10,855,1000,760505847,886204.0,4834.0,0.0,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?�,302,0.0,563,1000,40000,309404152,471220.0,48350.0,0.0,1238,300000000,2007,5000.0,7.1,0.0
2,Spectre?�,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?�,813,0.0,22000,23000,27000,448130642,1144337.0,106759.0,0.0,2701,250000000,2012,23000.0,8.5,0.0
4,John Carter?�,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,0.0

In [126]:
# Fill it with mean
df['DURATION']

0     178.0
1       NaN
2     148.0
3       NaN
4     132.0
5     156.0
6       NaN
7     141.0
8     141.0
9     153.0
10    183.0
11    169.0
12    106.0
13    151.0
Name: DURATION, dtype: float64

In [127]:
df['DURATION'].mean()

150.72727272727272

In [128]:
df_with_mean = df.DURATION.fillna(df['DURATION'].mean())

In [129]:
df_with_mean

0     178.000000
1     150.727273
2     148.000000
3     150.727273
4     132.000000
5     156.000000
6     150.727273
7     141.000000
8     141.000000
9     153.000000
10    183.000000
11    169.000000
12    106.000000
13    151.000000
Name: DURATION, dtype: float64

In [130]:
# Dropping NA
df.head()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?�,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?�,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?�,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?�,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?�,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN

In [131]:
df.isnull().sum().sum()

21

In [132]:
df.shape

(14, 16)

In [133]:
df_drop = df.dropna()

In [134]:
df_drop.shape

(4, 16)

In [135]:
df_drop

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
2,Spectre?�,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
8,Avengers: Age of Ultron?�,635,141.0,10,19000,26000,458991599,462669.0,92000.0,4.0,1117,250000000,2015,21000.0,7.5,2015.0
12,Quantum of Solace?�,403,106.0,395,393,451,168368427,330784.0,2023.0,1.0,1243,200000000,2008,412.0,6.7,2008.0
13,Pirates of the Caribbean: Dead Man's Chest?�,313,151.0,563,1000,40000,423032628,522040.0,48486.0,2.0,1832,225000000,2006,5000.0,7.3,2008.0

In [136]:
?df.dropna

Signature:
df.dropna(
    axis: 'Axis' = 0,
    how: 'str' = 'any',
    thresh=None,
    subset=None,
    inplace: 'bool' = False,
)
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    .. versionchanged:: 1.0.0

       Pass tuple or list to drop on multiple axes.
       Only a single axis is allowed.

how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

thresh : int, optional
    Require that many non-NA values.
subset : array-like, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    If True, do operation inplace and return None.

Returns
-------
DataFrame or None
    DataFrame with NA entries dropped from it or None if ``inplace=True``.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'toy'])
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep the DataFrame with valid entries in the same variable.

>>> df.dropna(inplace=True)
>>> df
     name        toy       born
1  Batman  Batmobile 1940-04-25
File:      c:\anaconda\lib\site-packages\pandas\core\frame.py
Type:      method

In [137]:
df.shape

(14, 16)

In [138]:
df.head()

,MOVIE_TITLE,NUM_CRITIC_FOR_REVIEWS,DURATION,DIRECTOR_FACEBOOK_LIKES,ACTOR_3_FACEBOOK_LIKES,ACTOR_1_FACEBOOK_LIKES,GROSS,NUM_VOTED_USERS,CAST_TOTAL_FACEBOOK_LIKES,FACENUMBER_IN_POSTER,NUM_USER_FOR_REVIEWS,BUDGET,TITLE_YEAR,ACTOR_2_FACEBOOK_LIKES,IMDB_SCORE,TITLE_YEAR.1
0,Avatar?�,723,178.0,10,855,1000,760505847,886204.0,4834.0,NaN,3054,237000000,2009,936.0,7.9,2009.0
1,Pirates of the Caribbean: At World's End?�,302,NaN,563,1000,40000,309404152,471220.0,48350.0,NaN,1238,300000000,2007,5000.0,7.1,NaN
2,Spectre?�,602,148.0,20,161,11000,200074175,275868.0,11700.0,1.0,994,245000000,2015,393.0,6.8,2015.0
3,The Dark Knight Rises?�,813,NaN,22000,23000,27000,448130642,1144337.0,106759.0,NaN,2701,250000000,2012,23000.0,8.5,NaN
4,John Carter?�,462,132.0,"""475""",530,640,73058679,212204.0,1873.0,1.0,738,263700000,2012,632.0,6.6,NaN

In [139]:
df_with_condition = df.dropna()

In [140]:
df_drop_with_condition = df.dropna(thresh=2)

In [141]:
df_drop_with_condition.shape

(14, 16)

In [142]:
df.shape

(14, 16)

In [143]:
df_drop_column = df.dropna(axis=1)

In [144]:
df_drop_column.shape

(14, 9)

## Data Cleaning In Python Practical Examples 3

##### *Working With Text Data
##### *Split A Column Into Multiple Columns
##### *Joining Two Columns
##### *Removing Words, Expression
##### *Searching For Strings and Expressions
##### *Replacing Words

In [145]:
# Load Dataset
df = pd.read_csv("C:\\Users\\ifybe\\Downloads\\dataset.csv")

In [146]:
df.head()

,id,Full Name,Date of Birth,email,gender,Job,Company,Country,Salary,Phone,Quote,Income,Income.1
0,1,Salim Pound,2/12/2018,spound0@spotify.com,Male,Editor,Gigashots,Israel,19QtDp5HkyuZZqwwqzYPSSLuA7MXFCwfKL,610-741-3882,Compatible discrete leverage,46476.638080,$46476.6380809961
1,2,Madelene Lutas,9/20/2018,mlutas1@si.edu,Female,VP Marketing,Wikivu,Mongolia,17ADLE8HiTj7m1tTbzboLDn7eiZ4TjetzZ,221-725-8860,Grass-roots real-time algorithm,54174.687950,$54174.6879482406
2,3,Dolli Swanbourne,11/18/2018,dswanbourne2@istockphoto.com,Female,Associate Professor,Dabfeed,Vietnam,16ThVxH72YAXWiEBeBZB1WYtXcfJMwUtoB,303-720-8280,Innovative system-worthy definition,5449.873348,$5449.87334818567
3,4,Graeme Croisier,9/29/2018,gcroisier3@parallels.com,Male,Mechanical Systems Engineer,Trudoo,Bosnia and Herzegovina,1JLUVwmjHvxgh53C7Afie3pWbjrYxV9Fnx,673-794-9917,Customer-focused didactic extranet,46784.630880,$46784.6308786279
4,5,Jillana Physic,4/19/2018,jphysic4@yellowbook.com,Female,Account Executive,Buzzshare,China,1DaEUNoAWL68pnvThSM5eBYgQMTv9mKyFG,709-146-6263,Progressive dynamic model,57486.495560,$57486.4955595568

In [147]:
df.columns

Index(['id', 'Full Name', 'Date of Birth', 'email', 'gender', 'Job', 'Company',
       'Country', 'Salary', 'Phone', 'Quote', 'Income', 'Income.1'],
      dtype='object')

In [148]:
df.columns.str.lower()

Index(['id', 'full name', 'date of birth', 'email', 'gender', 'job', 'company',
       'country', 'salary', 'phone', 'quote', 'income', 'income.1'],
      dtype='object')

In [149]:
df.columns = df.columns.str.lower()

In [150]:
df

,id,full name,date of birth,email,gender,job,company,country,salary,phone,quote,income,income.1
0,1,Salim Pound,2/12/2018,spound0@spotify.com,Male,Editor,Gigashots,Israel,19QtDp5HkyuZZqwwqzYPSSLuA7MXFCwfKL,610-741-3882,Compatible discrete leverage,46476.638080,$46476.6380809961
1,2,Madelene Lutas,9/20/2018,mlutas1@si.edu,Female,VP Marketing,Wikivu,Mongolia,17ADLE8HiTj7m1tTbzboLDn7eiZ4TjetzZ,221-725-8860,Grass-roots real-time algorithm,54174.687950,$54174.6879482406
2,3,Dolli Swanbourne,11/18/2018,dswanbourne2@istockphoto.com,Female,Associate Professor,Dabfeed,Vietnam,16ThVxH72YAXWiEBeBZB1WYtXcfJMwUtoB,303-720-8280,Innovative system-worthy definition,5449.873348,$5449.87334818567
3,4,Graeme Croisier,9/29/2018,gcroisier3@parallels.com,Male,Mechanical Systems Engineer,Trudoo,Bosnia and Herzegovina,1JLUVwmjHvxgh53C7Afie3pWbjrYxV9Fnx,673-794-9917,Customer-focused didactic extranet,46784.630880,$46784.6308786279
4,5,Jillana Physic,4/19/2018,jphysic4@yellowbook.com,Female,Account Executive,Buzzshare,China,1DaEUNoAWL68pnvThSM5eBYgQMTv9mKyFG,709-146-6263,Progressive dynamic model,57486.495560,$57486.4955595568
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Willie Gravestone,1/17/2018,wgravestonern@typepad.com,Female,Junior Executive,Cogilith,China,1NhweMA6xVPvFfYyQfRvusazTkMvuP8kap,717-137-5667,Automated content-based superstructure,33868.404190,$33868.4041871395
996,997,Samara McRitchie,12/10/2018,smcritchiero@wikispaces.com,Female,Media Manager II,Edgewire,Philippines,1t9C9e457Z6efZCZ46Ywm84Xgw79WEBW9,583-849-4461,Proactive content-based throughput,46290.780360,$46290.7803582873
997,998,Joceline Josefowicz,10/18/2018,jjosefowiczrp@statcounter.com,Female,Design Engineer,Mynte,Puerto Rico,13pFvvCyTz5AFNhk7ugp9G6aYA89wVJFns,934-388-0702,Phased transitional monitoring,24202.032530,$24202.0325327311
998,999,Andrei Lestor,1/16/2018,alestorrq@storify.com,Female,Senior Editor,Reallinks,China,1CTz1ejJhKvKUvV7tMgQ97wCguJpRAVZan,706-201-1239,Organic dynamic strategy,54316.293830,$54316.2938322092
999,1000,Nikkie Langtry,10/30/2018,nlangtryrr@sciencedaily.com,Female,Financial Advisor,Linklinks,Armenia,1JFRCVhkbkR9TFrS2RKezc7HKoteeUHzR,612-915-7537,Managed solution-oriented implementation,56477.000000,$56477

In [151]:
# Renaming
df.rename(columns={'full name':'full_name','date of birth':'date_of_date'})

,id,full_name,date_of_date,email,gender,job,company,country,salary,phone,quote,income,income.1
0,1,Salim Pound,2/12/2018,spound0@spotify.com,Male,Editor,Gigashots,Israel,19QtDp5HkyuZZqwwqzYPSSLuA7MXFCwfKL,610-741-3882,Compatible discrete leverage,46476.638080,$46476.6380809961
1,2,Madelene Lutas,9/20/2018,mlutas1@si.edu,Female,VP Marketing,Wikivu,Mongolia,17ADLE8HiTj7m1tTbzboLDn7eiZ4TjetzZ,221-725-8860,Grass-roots real-time algorithm,54174.687950,$54174.6879482406
2,3,Dolli Swanbourne,11/18/2018,dswanbourne2@istockphoto.com,Female,Associate Professor,Dabfeed,Vietnam,16ThVxH72YAXWiEBeBZB1WYtXcfJMwUtoB,303-720-8280,Innovative system-worthy definition,5449.873348,$5449.87334818567
3,4,Graeme Croisier,9/29/2018,gcroisier3@parallels.com,Male,Mechanical Systems Engineer,Trudoo,Bosnia and Herzegovina,1JLUVwmjHvxgh53C7Afie3pWbjrYxV9Fnx,673-794-9917,Customer-focused didactic extranet,46784.630880,$46784.6308786279
4,5,Jillana Physic,4/19/2018,jphysic4@yellowbook.com,Female,Account Executive,Buzzshare,China,1DaEUNoAWL68pnvThSM5eBYgQMTv9mKyFG,709-146-6263,Progressive dynamic model,57486.495560,$57486.4955595568
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Willie Gravestone,1/17/2018,wgravestonern@typepad.com,Female,Junior Executive,Cogilith,China,1NhweMA6xVPvFfYyQfRvusazTkMvuP8kap,717-137-5667,Automated content-based superstructure,33868.404190,$33868.4041871395
996,997,Samara McRitchie,12/10/2018,smcritchiero@wikispaces.com,Female,Media Manager II,Edgewire,Philippines,1t9C9e457Z6efZCZ46Ywm84Xgw79WEBW9,583-849-4461,Proactive content-based throughput,46290.780360,$46290.7803582873
997,998,Joceline Josefowicz,10/18/2018,jjosefowiczrp@statcounter.com,Female,Design Engineer,Mynte,Puerto Rico,13pFvvCyTz5AFNhk7ugp9G6aYA89wVJFns,934-388-0702,Phased transitional monitoring,24202.032530,$24202.0325327311
998,999,Andrei Lestor,1/16/2018,alestorrq@storify.com,Female,Senior Editor,Reallinks,China,1CTz1ejJhKvKUvV7tMgQ97wCguJpRAVZan,706-201-1239,Organic dynamic strategy,54316.293830,$54316.2938322092
999,1000,Nikkie Langtry,10/30/2018,nlangtryrr@sciencedaily.com,Female,Financial Advisor,Linklinks,Armenia,1JFRCVhkbkR9TFrS2RKezc7HKoteeUHzR,612-915-7537,Managed solution-oriented implementation,56477.000000,$56477

In [152]:
df.columns

Index(['id', 'full name', 'date of birth', 'email', 'gender', 'job', 'company',
       'country', 'salary', 'phone', 'quote', 'income', 'income.1'],
      dtype='object')

In [153]:
df.rename(columns={'full name':'full_name','date of birth':'date_of_date'}, inplace = True)

In [154]:
df.columns

Index(['id', 'full_name', 'date_of_date', 'email', 'gender', 'job', 'company',
       'country', 'salary', 'phone', 'quote', 'income', 'income.1'],
      dtype='object')

In [155]:
df.rename(columns={'full name':'full_name','date of birth':'date_of_birth'},inplace=True)

In [156]:
df.columns

Index(['id', 'full_name', 'date_of_date', 'email', 'gender', 'job', 'company',
       'country', 'salary', 'phone', 'quote', 'income', 'income.1'],
      dtype='object')

##### Spliting Column into Multiple Columns

In [157]:
# Method 1
df.full_name

0              Salim Pound
1           Madelene Lutas
2         Dolli Swanbourne
3          Graeme Croisier
4           Jillana Physic
              ...
995      Willie Gravestone
996       Samara McRitchie
997    Joceline Josefowicz
998          Andrei Lestor
999         Nikkie Langtry
Name: full_name, Length: 1000, dtype: object

In [158]:
df.full_name.str.split(' ')

0              [Salim, Pound]
1           [Madelene, Lutas]
2         [Dolli, Swanbourne]
3          [Graeme, Croisier]
4           [Jillana, Physic]
                ...
995      [Willie, Gravestone]
996       [Samara, McRitchie]
997    [Joceline, Josefowicz]
998          [Andrei, Lestor]
999         [Nikkie, Langtry]
Name: full_name, Length: 1000, dtype: object

In [159]:
df.full_name.str.split(' ')[0]

['Salim', 'Pound']

In [160]:
df.full_name.str.split(' ').str.get(0)

0         Salim
1      Madelene
2         Dolli
3        Graeme
4       Jillana
         ...
995      Willie
996      Samara
997    Joceline
998      Andrei
999      Nikkie
Name: full_name, Length: 1000, dtype: object

In [177]:
df['firstname'] =df.full_name.str.split(' ').str.get(0)

In [178]:
df.firstname

0         Salim
1      Madelene
2         Dolli
3        Graeme
4       Jillana
         ...
995      Willie
996      Samara
997    Joceline
998      Andrei
999      Nikkie
Name: firstname, Length: 1000, dtype: object

In [179]:
df['lastname'] = df.full_name.str.split(' ').str.get(1)

In [180]:
df.lastname

0           Pound
1           Lutas
2      Swanbourne
3        Croisier
4          Physic
          ...
995    Gravestone
996     McRitchie
997    Josefowicz
998        Lestor
999       Langtry
Name: lastname, Length: 1000, dtype: object

In [181]:
# Method 2  Working with more than 2 names
df.full_name

0              Salim Pound
1           Madelene Lutas
2         Dolli Swanbourne
3          Graeme Croisier
4           Jillana Physic
              ...
995      Willie Gravestone
996       Samara McRitchie
997    Joceline Josefowicz
998          Andrei Lestor
999         Nikkie Langtry
Name: full_name, Length: 1000, dtype: object

In [182]:
df1 = df

In [183]:
df1.full_name.str.split(' ',expand = True)

            0           1     2     3
0       Salim       Pound  None  None
1    Madelene       Lutas  None  None
2       Dolli  Swanbourne  None  None
3      Graeme    Croisier  None  None
4     Jillana      Physic  None  None
..        ...         ...   ...   ...
995    Willie  Gravestone  None  None
996    Samara   McRitchie  None  None
997  Joceline  Josefowicz  None  None
998    Andrei      Lestor  None  None
999    Nikkie     Langtry  None  None

[1000 rows x 4 columns]

In [186]:
#Spliting first name and leaving other names together

df1.full_name.str.split(' ', n=1,expand = True)

            0           1
0       Salim       Pound
1    Madelene       Lutas
2       Dolli  Swanbourne
3      Graeme    Croisier
4     Jillana      Physic
..        ...         ...
995    Willie  Gravestone
996    Samara   McRitchie
997  Joceline  Josefowicz
998    Andrei      Lestor
999    Nikkie     Langtry

[1000 rows x 2 columns]

# df.head(3)

In [ ]:
# Finding A String/Exp N Replace

In [188]:
df['income.1']

0      $46476.6380809961
1      $54174.6879482406
2      $5449.87334818567
3      $46784.6308786279
4      $57486.4955595568
             ...
995    $33868.4041871395
996    $46290.7803582873
997    $24202.0325327311
998    $54316.2938322092
999               $56477
Name: income.1, Length: 1000, dtype: object

In [190]:
df['income.1'].dtype

dtype('O')

In [191]:
df['income.1'].str.replace('$', '')

C:\Users\ifybe\AppData\Local\Temp/ipykernel_140/3281159252.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['income.1'].str.replace('$', '')

0      46476.6380809961
1      54174.6879482406
2      5449.87334818567
3      46784.6308786279
4      57486.4955595568
             ...
995    33868.4041871395
996    46290.7803582873
997    24202.0325327311
998    54316.2938322092
999               56477
Name: income.1, Length: 1000, dtype: object

In [194]:
df['income.1'].str.replace('$', 'Euro')

C:\Users\ifybe\AppData\Local\Temp/ipykernel_140/2547068588.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['income.1'].str.replace('$', 'Euro')

0      Euro46476.6380809961
1      Euro54174.6879482406
2      Euro5449.87334818567
3      Euro46784.6308786279
4      Euro57486.4955595568
               ...
995    Euro33868.4041871395
996    Euro46290.7803582873
997    Euro24202.0325327311
998    Euro54316.2938322092
999               Euro56477
Name: income.1, Length: 1000, dtype: object

In [195]:
df.head()

,id,full_name,date_of_date,email,gender,job,company,country,salary,phone,quote,income,income.1,lastname,Firstname,firstname
0,1,Salim Pound,2/12/2018,spound0@spotify.com,Male,Editor,Gigashots,Israel,19QtDp5HkyuZZqwwqzYPSSLuA7MXFCwfKL,610-741-3882,Compatible discrete leverage,46476.638080,$46476.6380809961,Pound,Salim,Salim
1,2,Madelene Lutas,9/20/2018,mlutas1@si.edu,Female,VP Marketing,Wikivu,Mongolia,17ADLE8HiTj7m1tTbzboLDn7eiZ4TjetzZ,221-725-8860,Grass-roots real-time algorithm,54174.687950,$54174.6879482406,Lutas,Madelene,Madelene
2,3,Dolli Swanbourne,11/18/2018,dswanbourne2@istockphoto.com,Female,Associate Professor,Dabfeed,Vietnam,16ThVxH72YAXWiEBeBZB1WYtXcfJMwUtoB,303-720-8280,Innovative system-worthy definition,5449.873348,$5449.87334818567,Swanbourne,Dolli,Dolli
3,4,Graeme Croisier,9/29/2018,gcroisier3@parallels.com,Male,Mechanical Systems Engineer,Trudoo,Bosnia and Herzegovina,1JLUVwmjHvxgh53C7Afie3pWbjrYxV9Fnx,673-794-9917,Customer-focused didactic extranet,46784.630880,$46784.6308786279,Croisier,Graeme,Graeme
4,5,Jillana Physic,4/19/2018,jphysic4@yellowbook.com,Female,Account Executive,Buzzshare,China,1DaEUNoAWL68pnvThSM5eBYgQMTv9mKyFG,709-146-6263,Progressive dynamic model,57486.495560,$57486.4955595568,Physic,Jillana,Jillana

### Finding A String/Expression
##### * Str.contains
##### * Filter
##### * Str.match

In [197]:
df.salary

0      19QtDp5HkyuZZqwwqzYPSSLuA7MXFCwfKL
1      17ADLE8HiTj7m1tTbzboLDn7eiZ4TjetzZ
2      16ThVxH72YAXWiEBeBZB1WYtXcfJMwUtoB
3      1JLUVwmjHvxgh53C7Afie3pWbjrYxV9Fnx
4      1DaEUNoAWL68pnvThSM5eBYgQMTv9mKyFG
                      ...
995    1NhweMA6xVPvFfYyQfRvusazTkMvuP8kap
996     1t9C9e457Z6efZCZ46Ywm84Xgw79WEBW9
997    13pFvvCyTz5AFNhk7ugp9G6aYA89wVJFns
998    1CTz1ejJhKvKUvV7tMgQ97wCguJpRAVZan
999     1JFRCVhkbkR9TFrS2RKezc7HKoteeUHzR
Name: salary, Length: 1000, dtype: object

In [196]:
# As Boolean

df.salary.str.contains('19')

0       True
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: salary, Length: 1000, dtype: bool

In [198]:
# Get the actual value

df[df.salary.str.contains('19')]

,id,full_name,date_of_date,email,gender,job,company,country,salary,phone,quote,income,income.1,lastname,Firstname,firstname
0,1,Salim Pound,2/12/2018,spound0@spotify.com,Male,Editor,Gigashots,Israel,19QtDp5HkyuZZqwwqzYPSSLuA7MXFCwfKL,610-741-3882,Compatible discrete leverage,46476.638080,$46476.6380809961,Pound,Salim,Salim
20,21,Luther Patullo,12/23/2017,lpatullok@berkeley.edu,Male,Staff Accountant III,Realbridge,Tanzania,19cuF6DFRcVNZ8sCLrQm28WqxMrtN8iH1R,259-891-8172,Centralized client-server structure,14671.956540,$14671.9565416425,Patullo,Luther,Luther
38,39,Lissa Ballefant,5/5/2018,lballefant12@wsj.com,Female,Software Engineer I,Wordpedia,Philippines,19VeUFUHYiTVPJL61TY41ySzJ1Kvt21emk,718-582-6068,Exclusive disintermediate challenge,39199.865720,$39199.8657185583,Ballefant,Lissa,Lissa
64,65,Salli Reedman,7/22/2018,sreedman1s@imdb.com,Female,Registered Nurse,Realfire,Russia,19GSHk6D7AnmJ4YNXp2UrS6dgdaLvWtU9M,351-818-8151,Object-based mission-critical product,46326.181830,$46326.1818292795,Reedman,Salli,Salli
70,71,Neville Creak,4/13/2018,ncreak1y@drupal.org,Male,Web Developer III,Ooba,United States,19iBZGp3i77eGzYwEkdNvXmCp2r8sc79Um,818-341-7003,Switchable interactive parallelism,32093.020420,$32093.0204168828,Creak,Neville,Neville
81,82,Herschel Izac,12/6/2018,hizac29@usnews.com,Male,Data Coordiator,Avamm,Japan,19QuYFpFge3wV51Pmhkrfymuy8dhrMcNqD,665-422-7430,Enhanced methodical support,3180.639058,$3180.63905758843,Izac,Herschel,Herschel
99,100,Sheryl Sworder,1/17/2018,ssworder2r@uiuc.edu,Female,Administrative Assistant II,Flashspan,Sri Lanka,199P1RiCA82T3BQuAUSwVCMv9nXVogPQ75,414-779-3675,Persistent web-enabled functionalities,27570.482500,$27570.4824976348,Sworder,Sheryl,Sheryl
146,147,Lombard Crasswell,10/18/2018,lcrasswell42@wisc.edu,Male,Professor,Skibox,China,1Hz4L19ERh7LtYuLWWKD9RRSnVSyUyMrDH,105-887-6347,Reactive zero tolerance encoding,38799.829100,$38799.8290963469,Crasswell,Lombard,Lombard
152,153,Gun Winspear,12/14/2018,gwinspear48@uol.com.br,Male,Chemical Engineer,Meezzy,Russia,19E97wqMKcyNWStaWyfJDu2JYX2uNKcRHF,442-216-1240,Configurable optimizing orchestration,57376.751000,$57376.7509994811,Winspear,Gun,Gun
205,206,Shaylyn Mateu,2/9/2018,smateu5p@thetimes.co.uk,Female,Recruiter,Jaxspan,China,19Gut2jhyjNL9kyx96fuJtRsB5dkYhCetT,952-317-3195,Balanced web-enabled algorithm,56351.878410,$56351.8784142583,Mateu,Shaylyn,Shaylyn
218,219,Alvin Maryin,11/7/2018,amaryin62@boston.com,Male,Assistant Professor,Brainverse,China,19rYTFW9rySEeVrCrChcHxAZBmKfZLGRDq,944-449-5346,Customer-focused systematic open architecture,34785.302290,$34785.3022858364,Maryin,Alvin,Alvin
220,221,Adaline Clilverd,9/19/2018,aclilverd64@xing.com,Female,Media Manager III,Twitterworks,Nigeria,19CTD7F7CLxSsj7vNwZWPpKv5qUZXcyoHc,116-476-5906,Inverse actuating secured line,12623.981440,$12623.9814447462,Clilverd,Adaline,Adaline
230,231,Frannie Blythe,1/6/2018,fblythe6e@naver.com,Male,Product Engineer,Linkbridge,Philippines,17rSzh19PWTGVGEQAsLcSHv8GFnYJC2gfq,559-479-2966,Up-sized optimal support,8466.078677,$8466.07867671743,Blythe,Frannie,Frannie
275,276,Stepha Gensavage,9/7/2018,sgensavage7n@exblog.jp,Female,Paralegal,Quimm,Brazil,19FCY74yi5iSert8Q2SZwX1GjVmVFrbtTw,937-934-6619,Self-enabling holistic frame,43069.246500,$43069.246498001,Gensavage,Stepha,Stepha
277,278,Evered Guiducci,1/25/2018,eguiducci7p@alexa.com,Male,Food Chemist,Dabfeed,Brazil,19Kanj1SKfKq2HgFEU74fcBTDNdErRoBKB,496-612-7568,Grass-roots analyzing functionalities,57580.309460,$57580.3094576861,Guiducci,Evered,Evered
281,282,Ransell Vivians,1/17/2018,rvivians7t@yellowbook.com,Male,Social Worker,Quinu,France,192tKhqdqd6G3YEyjapaPYKPCasea56K4P,554-223-9306,Public-key transitional frame,12077.028720,$12077.0287179174,Vivians,Ransell,Ransell
289,290,Alley Nelle,11/11/2018,anelle81@nytimes.com,Male,Software Engineer I,Blogspan,Indonesia,19zAEeft7FbQW77B9L8Rxc13trcmUH56uo,446-346-7067,Optimized object-oriented project,36376.598410,$36376.5984069338,Nelle,Alley,Alley
308,309,Farley McAlinden,11/1/2018,fmcalinden8k@amazon.co.uk,Male,Electrical Engineer,Tagopia,Iran,19xcSdXCLwfSFRrgD9sguehCc6AHem1Auy,459-428-7733,Grass-roots client-server capability,23449.751270,$23449.7512741477,McAlinden,Farley,Farley
318,319,Theodosia Rignold,7/13/2018,trignold8u@list-manage.com,Female,Senior Developer,Kwimbee,China,19gHRWmbDizew4mpQ8p2vNwENB9deVfAJ6,791-420-1282,Centralized asymmetric access,27115.573600,$27115.5735953856,Rignold,Theodosia,Theodosia
335,336,Carine Knowlden,4/7/2018,cknowlden9b@springer.com,Female,Web Designer III,Mycat,Iran,19Ak7CmUU5be8wjALhqxnV6u7HhNFZWbga,252-711-5985,Assimilated uniform archive,5446.333201,$5446.33320108646,Knowlden,Carine,Carine
367,368,Dillie Bigglestone,7/2/2018,dbigglestonea7@webs.com,Male,Health Coach III,Blogpad,Finland,19ZPfBQ7FG76N9UJgaTSVQWkTE1BGKpEc,209-519-8227,Balanced well-modulated attitude,33647.144990,$33647.1449934385,Bigglestone,Dillie,Dillie
380,381,Giorgi Bosche,4/8/2018,gboscheak@miibeian.gov.cn,Male,Clinical Specialist,Tambee,Papua New Guinea,19BGJ4qNnST6nAboZJDRpgn5jnPLAhT7h9,224-570-9648,Versatile composite approach,33638.294630,$33638.2946256905,Bosche,Giorgi,Giorgi
386,387,Vyky Roads,10/12/2018,vroadsaq@goo.gl,Female,Database Administrator III,Trudeo,Brazil,191XmaxsY7FRnZhZYYtzPREgaMf3vThk29,667-711-3128,Fully-configurable well-modulated structure,10848.597670,$10848.5976744896,Roads,Vyky,Vyky
393,394,Chad Sesons,8/6/2018,csesonsax@blogs.com,Female,Sales Representative,Edgeblab,China,199RNkFJ6snHkexwntv73G26PEpoTmbZLt,903-659-1163,Phased intangible service-desk,10361.827450,$10361.8274483474,Sesons,Chad,Chad
415,416,Antonio Chastang,12/5/2018,achastangbj@harvard.edu,Male,Senior Cost Accountant,Thoughtbeat,China,199v4fsREMPYmgKP2mABEkeciBeGiLZKS2,694-361-3477,Extended eco-centric projection,39343.241680,$39343.2416760765,Chastang,Antonio,Antonio
416,417,Vernon McGilben,2/10/2018,vmcgilbenbk@nps.gov,Male,Payment Adjustment Coordinator,Realmix,China,19oNbmSk9Rj9hoCVZEhg252o8SwbCPVyTr,942-862-0375,Versatile client-server artificial intelligence,53967.589340,$53967.5893429365,McGilben,Vernon,Vernon
418,419,Artemas Compson,4/16/2018,acompsonbm@yellowbook.com,Male,Registered Nurse,Tekfly,Sweden,19WFvtTK5LNyzdr7rx4CwV2dgyxLVc1PRd,223-945-4100,User-centric responsive installation,22651.448100,$22651.4481032746,Compson,Artemas,Artemas
429,430,Woodman Challiner,7/14/2018,wchallinerbx@pcworld.com,Male,Project Manager,Trunyx,Philippines,1958qBbPo62bVNmYcbTCj6oMfKgFDAmGjS,514-742-2116,Monitored asymmetric ability,30151.249730,$30151.249732963,Challiner,Woodman,Woodman
430,431,Michaeline Bloxsome,4/15/2018,mbloxsomeby@twitter.com,Female,Graphic Designer,Rooxo,Peru,19RnmfhytxasgUWEwKxrtmLPmoMRLRa7kJ,515-690-2376,Phased bottom-line model,53294.961390,$53294.9613940855,Bloxsome,Michaeline,Michaeline
432,433,Aldis Juggings,1/28/2018,ajuggingsc0@java.com,Male,Geological Engineer,Yacero,Philippines,19smVfq1VYJMcjHA6b93N2MVeJ8L2rjaCV,314-294-6390,Networked disintermediate benchmark,39029.938660,$39029.938657796,Juggings,Aldis,Aldis
555,556,Lowell Blague,6/11/2018,lblagueff@ucla.edu,Male,Director of Sales,Skivee,Thailand,19hXd2pLSZpyym6KNukWs1vnxt5MBbdSun,538-753-9138,Object-based zero defect matrices,32985.137490,$32985.1374858852,Blague,Lowell,Lowell
577,578,Pauli Dagwell,3/22/2018,pdagwellg1@tumblr.com,Female,Software Engineer II,Jaloo,Russia,174aQBRay19V7XYPse7N7MkbUhhiDTmEQa,924-170-5456,Reduced content-based database,21146.885590,$21146.885586108,Dagwell,Pauli,Pauli
591,592,Morey Skittles,2/4/2018,mskittlesgf@amazon.de,Male,GIS Technical Architect,Twitterlist,China,19CpEtBk4phFmb3ruVG12sAw4p7YQ1MYQk,151-222-1166,Adaptive dedicated collaboration,23571.886350,$23571.8863490707,Skittles,Morey,Morey
609,610,Papagena Lanfear,1/2/2018,planfeargx@angelfire.com,Female,Biostatistician II,Ailane,Belgium,19x2uAf3bpLBUCmWfo6PkWK7LV8DnL7UNL,405-741-4928,Reactive explicit budgetary management,7943.906980,$7943.90697958312,Lanfear,Papagena,Papagena
611,612,Nealon Peerless,6/22/2018,npeerlessgz@cam.ac.uk,Male,Automation Specialist IV,Katz,Czech Republic,19J9vCmE2zKe15EWUurtdxhubYcknnGsP5,817-950-9976,User-centric contextually-based protocol,47935.178690,$47935.178685873,Peerless,Nealon,Nealon
617,618,Lynnea Frostdicke,9/16/2018,lfrostdickeh5@pagesperso-orange.fr,Female,Speech Pathologist,Twimm,Democratic Republic of the Congo,19e6dgQTNDTLjJE2LibAFPfpa748Q93ze6,147-895-1476,Polarised uniform knowledge user,34673.787650,$34673.7876522111,Frostdicke,Lynnea,Lynnea
618,619,Hailey Attlee,4/23/2018,hattleeh6@simplemachines.org,Male,Actuary,Skibox,Poland,1FXi3PaowPtmgcNX6919pq7G3fS1uvnxhP,101-913-0094,Team-oriented eco-centric algorithm,54833.155310,$54833.1553086947,Attlee,Hailey,Hailey
631,632,Nydia Ewbank,1/28/2018,newbankhj@wunderground.com,Female,Senior Editor,Trunyx,China,19pEtJqo5F8kdWHB1o6pkMDZpZUnvjUU72,278-370-3775,Customer-focused value-added approach,56633.320110,$56633.3201086459,Ewbank,Nydia,Nydia
655,656,Annmaria Dungee,12/5/2018,adungeei7@irs.gov,Female,Health Coach II,Skynoodle,China,19V5MYLbVHZhkAmsxSrHRaj1WZHGmsd1kc,730-966-2394,Down-sized explicit application,34794.152650,$34794.1526535844,Dungee,Annmaria,Annmaria
705,706,Clary Luckcock,10/10/2018,cluckcockjl@wiley.com,Female,Business Systems Development Analyst,Thoughtworks,Ivory Coast,1MzRuC19bXzA12TEAxNx9Jhz2gQYGNtSaG,591-918-1919,Multi-tiered high-level product,36095.156710,$36095.1567125462,Luckcock,Clary,Clary
717,718,Jacquelin de Cullip,3/4/2018,jdejx@vkontakte.ru,Female,Structural Engineer,Leexo,Peru,195fGWc4rWymhzSiEPTNNAVgaJpczr2pDS,898-431-6679,Persistent heuristic customer loyalty,41180.578020,$41180.5780205695,de,Jacquelin,Jacquelin
733,734,Jonas Craven,2/22/2018,jcravenkd@independent.co.uk,Male,Speech Pathologist,Kare,Liberia,193m6JgkXxp4Cv6CUz8btTXbLUvyqyQYEw,689-786-4265,Centralized mobile algorithm,36518.204290,$36518.2042909024,Craven,Jonas,Jonas
757,758,Felita Gallager,1/8/2018,fgallagerl1@slideshare.net,Female,Speech Pathologist,Talane,China,19rCc7VFEgXg8VH86upzek5Yff3FDS2iT4,922-817-0306,Diverse well-modulated access,51963.866080,$51963.8660847804,Gallager,Felita,Felita
779,780,Babb Diver,12/22/2017,bdiverln@mediafire.com,Female,Tax Accountant,Devpoint,Japan,19BPKxyHBd89kT2D2C7cmGAFjJ2dA98s3e,398-362-0099,Multi-tiered web-enabled workforce,52278.939180,$52278.9391766106,Diver,Babb,Babb
803,804,Yankee Huncote,11/26/2018,yhuncotemb@123-reg.co.uk,Male,Project Manager,Avaveo,Ecuador,19eGFEVCXFeSpx7Rv7QDaj7EsLprCnoenc,828-299-7073,Visionary regional protocol,48455.580310,$48455.5803094577,Huncote,Yankee,Yankee
820,821,Gaultiero Scrivinor,4/27/2018,gscrivinorms@usnews.com,Male,Programmer Analyst I,Gabcube,Ukraine,19VDWubMWndKzG7N1fqfGkPpsAvxkKEp2P,326-187-3038,Streamlined web-enabled access,7418.195135,$7418.19513534959,Scrivinor,Gaultiero,Gaultiero
835,836,Oren Butterfill,9/17/2018,obutterfilln7@bloglines.com,Male,Programmer Analyst I,Rooxo,Brazil,19nFjmnjJNLVejQaEq8ciXYbQWgXUmXuRN,187-866-1199,Self-enabling discrete leverage,46002.258370,$46002.2583697012,Butterfill,Oren,Oren
846,847,Arlen Done,2/4/2018,adoneni@cnn.com,Female,Software Engineer II,Youfeed,China,19HjqtgqS3aRe88b6hHC7PDxwCrCjLuUd2,464-315-3002,Triple-buffered fault-tolerant project,17390.789510,$17390.7895138401,Done,Arlen,Arlen
899,900,Rorie Lynn,10/15/2018,rlynnoz@bandcamp.com,Female,Mechanical Systems Engineer,Omba,China,191BifRRPdjvGNEPHWTVcFLtNwNGRQDF5Z,728-468-9505,Customer-focused cohesive encryption,51071.749020,$51071.749015778,Lynn,Rorie,Rorie
901,902,Joelle Fermor,10/9/2018,jfermorp1@imageshack.us,Female,Senior Editor,Pixoboo,Armenia,19gyWrKC6CWNCUk4cspYgFcvnnjJdYRnku,507-332-0156,Team-oriented value-added utilisation,41325.724050,$41325.7240516373,Fermor,Joelle,Joelle
903,904,Rhoda Speeding,5/27/2018,rspeedingp3@printfriendly.com,Female,Compensation Analyst,Fivespan,Japan,19T282CU1tSnTpP7RXpNpCJi5jvSUwqKAy,849-448-8593,Synergized uniform array,50186.712240,$50186.7122409741,Speeding,Rhoda,Rhoda
908,909,Jocko Amorts,1/21/2018,jamortsp8@intel.com,Male,Tax Accountant,Thoughtbeat,Indonesia,19NAwzMBgFD6LQ52xKDe5NGAeUQ7uXbv6F,983-403-5353,Secured optimal internet solution,46257.148960,$46257.1489608448,Amorts,Jocko,Jocko
939,940,Martie Brooksbie,1/5/2018,mbrooksbieq3@bing.com,Male,Web Developer I,Quamba,Poland,1P3W6bgmM7aXZXZPLABDfQT4Ze5mf193nU,317-416-2362,Versatile intangible hub,46366.893520,$46366.8935209204,Brooksbie,Martie,Martie
940,941,Xever Hubbold,5/9/2018,xhubboldq4@yale.edu,Male,Staff Scientist,Vidoo,Poland,19psKeKSYCcXeK4g4wz1oqF7zSCcnayTPW,785-652-9482,Adaptive local functionalities,9395.367290,$9395.36729026154,Hubbold,Xever,Xever
957,958,Doralyn Iskowitz,2/7/2018,diskowitzql@earthlink.net,Female,Database Administrator IV,Tekfly,Cuba,19nt2oDmG644xYtzMtS98aBjhMD5crA7k6,175-577-2016,Enterprise-wide client-driven methodology,39493.697930,$39493.6979277932,Iskowitz,Doralyn,Doralyn
961,962,Ianthe Persian,8/19/2018,ipersianqp@phoca.cz,Female,Systems Administrator III,Zoovu,Kenya,198WGj1XpE3TbDfU89hpWQyPKaT7oToY9g,413-520-2861,Business-focused next generation customer loyalty,52280.709250,$52280.7092501602,Persian,Ianthe,Ianthe
964,965,Emelia Edmonds,4/29/2018,eedmondsqs@squidoo.com,Female,Biostatistician III,Realcube,France,1DWEpwCnQFvWUmDHpAsBizDiQ19eUGzuy,852-650-9710,Diverse bi-directional hub,25819.879760,$25819.8797570727,Edmonds,Emelia,Emelia
982,983,Tomasine Dawnay,8/10/2018,tdawnayra@lycos.com,Female,Senior Editor,Edgewire,Brazil,1C19HDk2gAAgtN7jYkYbZxcK49KFLjJqa9,466-963-6253,Fully-configurable impactful initiative,NaN,$,Dawnay,Tomasine,Tomasine

In [200]:
df.salary.str.contains('19|17')

0       True
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: salary, Length: 1000, dtype: bool

In [201]:
df.salary.str.contains('19|17',regex = True)

0       True
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: salary, Length: 1000, dtype: bool

In [203]:
df.salary.str.match('19')

0       True
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: salary, Length: 1000, dtype: bool

In [207]:
df.quote

0                  Compatible discrete leverage
1               Grass-roots real-time algorithm
2           Innovative system-worthy definition
3            Customer-focused didactic extranet
4                     Progressive dynamic model
                         ...
995      Automated content-based superstructure
996          Proactive content-based throughput
997              Phased transitional monitoring
998                    Organic dynamic strategy
999    Managed solution-oriented implementation
Name: quote, Length: 1000, dtype: object

In [208]:
df.quote.str.match('Operative')

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: quote, Length: 1000, dtype: bool

In [209]:
df[df.quote.str.match('Operative')]

,id,full_name,date_of_date,email,gender,job,company,country,salary,phone,quote,income,income.1,lastname,Firstname,firstname
7,8,Melina Boon,12/18/2017,mboon7@weibo.com,Female,Assistant Manager,Kanoodle,Colombia,1BRHmiaJur3qG1H4H1WsU8VJLKHwxvqRwF,280-484-7263,Operative coherent frame,8528.031251,$8528.0312509537,Boon,Melina,Melina
110,111,Ema Buck,6/29/2018,ebuck32@g.co,Female,Civil Engineer,Linkbridge,China,1KaWubTcNW5yc9YvdSDcAsJ7AKCr3BbUXq,773-675-4907,Operative neutral open system,16302.194280,$16302.1942808313,Buck,Ema,Ema
138,139,Hunt Dockrill,10/11/2018,hdockrill3u@chron.com,Male,Chief Design Engineer,Dabvine,Iran,16rhNv6bDooDsyscw72Yq4YQDgbe9kHHn1,243-149-7140,Operative scalable concept,52431.165500,$52431.1655018769,Dockrill,Hunt,Hunt
164,165,Ron Matherson,9/18/2018,rmatherson4k@amazon.de,Male,Internal Auditor,Rooxo,Philippines,1PuoqLCBv7DNEzy9WxAg72jcKeZxYU1EXc,950-659-1921,Operative clear-thinking hierarchy,28921.048620,$28921.0486159856,Matherson,Ron,Ron
314,315,Cher Wetherhead,9/16/2018,cwetherhead8q@unblog.fr,Female,Chief Design Engineer,Oyoyo,Brazil,12Br8Ajzp8K4KULTCeowgvC2fU49MLywuf,265-511-6121,Operative tangible encryption,13850.642410,$13850.6424146245,Wetherhead,Cher,Cher
328,329,Alasdair Fronsek,10/10/2018,afronsek94@freewebs.com,Male,Human Resources Assistant IV,Topiclounge,Indonesia,1LhSdbYKcfFYUEfZNKpmHoVJ99kkoxqkE8,168-998-4173,Operative attitude-oriented firmware,38898.953220,$38898.953215125,Fronsek,Alasdair,Alasdair
552,553,Auria Saller,7/3/2018,asallerfc@census.gov,Female,Payment Adjustment Coordinator,Avavee,Dominican Republic,182UDif5TKzAFwwGjhfc9iS4RAwgor6cDG,575-916-0590,Operative systemic secured line,13817.011020,$13817.0110171819,Saller,Auria,Auria
565,566,Anna-maria Kingwell,2/1/2018,akingwellfp@amazon.com,Female,Research Assistant I,Linkbridge,Indonesia,1JdNGd1qhaHCQMqVoo5B3P7jxG3z6xcGQL,968-196-0429,Operative responsive website,45129.612110,$45129.6121097446,Kingwell,Anna-maria,Anna-maria
640,641,Vincents Loseke,6/9/2018,vlosekehs@wikia.com,Male,Financial Advisor,Innotype,Bulgaria,1QB6QprFNH3VP6BCNbcqKxH2bKsSrvds3H,206-112-4387,Operative bifurcated success,28120.975370,$28120.9753715629,Loseke,Vincents,Vincents
644,645,Giffard Barnfield,4/18/2018,gbarnfieldhw@google.com.hk,Male,Health Coach III,Dablist,Portugal,1Ex4y8V6hgfhZYFpE7JGYrjmCvRrDvAhkg,207-281-7839,Operative tangible challenge,20992.889190,$20992.8891872921,Barnfield,Giffard,Giffard
861,862,Jamesy Mathely,8/11/2018,jmathelynx@scientificamerican.com,Male,Internal Auditor,Blogtag,China,1LPBL8jPDLFHsNX4EvK6hGQmtjhiSSw5XK,868-552-4800,Operative mobile open architecture,8582.903531,$8582.90353099155,Mathely,Jamesy,Jamesy
928,929,Hube Aimeric,12/13/2018,haimericps@foxnews.com,Male,Quality Engineer,Voolia,United States,1AJAxc977EwqwTEHrgMjgwUS7QGaJxkUQG,914-801-7357,Operative hybrid project,10030.823690,$10030.8236945708,Aimeric,Hube,Hube

In [211]:
# Finding An Index
df.salary.filter(regex='18',axis=0)

18     1MHrrY7pFbXDxNa411ePxRe3vgnYs9yTFH
118    1AwpwF96DD6Z2sys5cYr1d8Bug9in2vMyC
180    12bU7LbQptqzzWfH1ByMHJZSRGQeAY4uDn
181    16w3ofbq4pVY7ZozedKFtqcsMRNKfNQ9FN
182    17JDB9m51q3VUP6JcH378A4mfKc7zZr84h
183    1Fc69FUykHCUDiAbPTBdY7gYpHCFaPF92H
184    16hjmTDM9AqymMqw347i1UHyKbkFVu8usP
185     1WN1eFpNnCSLdKxihzBqymmQt9trZ7zy4
186    1BLeNSt4JaA6SQ3zctur8n1ghGYm6uumWW
187    16pM7yBa8K9uTYfsHkDdRT4HEc2mpk7ayt
188    16UMARArn5LBMUQFMbCCB1spgDPbxVNtV1
189    1EnThyx9SiKspr2kpU9UimL54qack5FmRE
218    19rYTFW9rySEeVrCrChcHxAZBmKfZLGRDq
318    19gHRWmbDizew4mpQ8p2vNwENB9deVfAJ6
418    19WFvtTK5LNyzdr7rx4CwV2dgyxLVc1PRd
518    1HuWE8PqqPhxvqafKQkbeqh9gqj13nsNFq
618    1FXi3PaowPtmgcNX6919pq7G3fS1uvnxhP
718    1PTV4YaMmrG7EC5eGoNHsoZYooxiNLFz9E
818    1CGEV9RM2LipNssS9na2KyZdHaEq9Dj8Sk
918    1K4msXtEXTyZAqTb3P8spTwpSLboHReoeS
Name: salary, dtype: object

In [212]:
# Joining Columns Together
df.head()

,id,full_name,date_of_date,email,gender,job,company,country,salary,phone,quote,income,income.1,lastname,Firstname,firstname
0,1,Salim Pound,2/12/2018,spound0@spotify.com,Male,Editor,Gigashots,Israel,19QtDp5HkyuZZqwwqzYPSSLuA7MXFCwfKL,610-741-3882,Compatible discrete leverage,46476.638080,$46476.6380809961,Pound,Salim,Salim
1,2,Madelene Lutas,9/20/2018,mlutas1@si.edu,Female,VP Marketing,Wikivu,Mongolia,17ADLE8HiTj7m1tTbzboLDn7eiZ4TjetzZ,221-725-8860,Grass-roots real-time algorithm,54174.687950,$54174.6879482406,Lutas,Madelene,Madelene
2,3,Dolli Swanbourne,11/18/2018,dswanbourne2@istockphoto.com,Female,Associate Professor,Dabfeed,Vietnam,16ThVxH72YAXWiEBeBZB1WYtXcfJMwUtoB,303-720-8280,Innovative system-worthy definition,5449.873348,$5449.87334818567,Swanbourne,Dolli,Dolli
3,4,Graeme Croisier,9/29/2018,gcroisier3@parallels.com,Male,Mechanical Systems Engineer,Trudoo,Bosnia and Herzegovina,1JLUVwmjHvxgh53C7Afie3pWbjrYxV9Fnx,673-794-9917,Customer-focused didactic extranet,46784.630880,$46784.6308786279,Croisier,Graeme,Graeme
4,5,Jillana Physic,4/19/2018,jphysic4@yellowbook.com,Female,Account Executive,Buzzshare,China,1DaEUNoAWL68pnvThSM5eBYgQMTv9mKyFG,709-146-6263,Progressive dynamic model,57486.495560,$57486.4955595568,Physic,Jillana,Jillana

In [213]:
# Method 1
df.firstname + df.email

0                   Salimspound0@spotify.com
1                     Madelenemlutas1@si.edu
2          Dollidswanbourne2@istockphoto.com
3             Graemegcroisier3@parallels.com
4             Jillanajphysic4@yellowbook.com
                       ...
995          Williewgravestonern@typepad.com
996        Samarasmcritchiero@wikispaces.com
997    Jocelinejjosefowiczrp@statcounter.com
998              Andreialestorrq@storify.com
999        Nikkienlangtryrr@sciencedaily.com
Length: 1000, dtype: object

In [215]:
# Method 1
df.firstname +'_'+ df.email

0                   Salim_spound0@spotify.com
1                     Madelene_mlutas1@si.edu
2          Dolli_dswanbourne2@istockphoto.com
3             Graeme_gcroisier3@parallels.com
4             Jillana_jphysic4@yellowbook.com
                        ...
995          Willie_wgravestonern@typepad.com
996        Samara_smcritchiero@wikispaces.com
997    Joceline_jjosefowiczrp@statcounter.com
998              Andrei_alestorrq@storify.com
999        Nikkie_nlangtryrr@sciencedaily.com
Length: 1000, dtype: object

In [216]:
# Method 2
dfall = df[['firstname','email']].apply('_'.join,axis=1)

In [217]:
dfall

0                   Salim_spound0@spotify.com
1                     Madelene_mlutas1@si.edu
2          Dolli_dswanbourne2@istockphoto.com
3             Graeme_gcroisier3@parallels.com
4             Jillana_jphysic4@yellowbook.com
                        ...
995          Willie_wgravestonern@typepad.com
996        Samara_smcritchiero@wikispaces.com
997    Joceline_jjosefowiczrp@statcounter.com
998              Andrei_alestorrq@storify.com
999        Nikkie_nlangtryrr@sciencedaily.com
Length: 1000, dtype: object

In [218]:
# Counting Stings in A Column
df.quote

0                  Compatible discrete leverage
1               Grass-roots real-time algorithm
2           Innovative system-worthy definition
3            Customer-focused didactic extranet
4                     Progressive dynamic model
                         ...
995      Automated content-based superstructure
996          Proactive content-based throughput
997              Phased transitional monitoring
998                    Organic dynamic strategy
999    Managed solution-oriented implementation
Name: quote, Length: 1000, dtype: object

In [221]:
#Method 1 
df.quote.str.count(' ') + 1

0      3
1      3
2      3
3      3
4      3
      ..
995    3
996    3
997    3
998    3
999    3
Name: quote, Length: 1000, dtype: int64

In [224]:
# Method 2
df.quote.str.split().str.len()

0      3
1      3
2      3
3      3
4      3
      ..
995    3
996    3
997    3
998    3
999    3
Name: quote, Length: 1000, dtype: int64

In [225]:
# Method 3
df.quote.str.split().map(len)

0      3
1      3
2      3
3      3
4      3
      ..
995    3
996    3
997    3
998    3
999    3
Name: quote, Length: 1000, dtype: int64

In [226]:
# Method 4
df.quote.str.split().apply(len)

0      3
1      3
2      3
3      3
4      3
      ..
995    3
996    3
997    3
998    3
999    3
Name: quote, Length: 1000, dtype: int64

In [227]:
df.quote.str.split().apply(len).value_counts()

3    744
4    209
5     44
6      3
Name: quote, dtype: int64